sengPrograms.org
* University of Calgary

https://www.ucalgary.ca/future-students/undergraduate/explore-programs/software-engineering

** Program description:

https://www.ucalgary.ca/pubs/calendar/current/en-4-9.html

There are some variations of the program:

- Regular Program
- Minors:
  - Aerospace
  - Biomedical Engineering
  - Mechatronics
  - BComm combined

** Courses description

https://www.ucalgary.ca/pubs/calendar/current/software-engineering.html

SEng courses are taught by the CS deparment. See, for example:

https://contacts.ucalgary.ca/info/cpsc/courses/w24


** Organization: Department of Software Engineering

https://schulich.ucalgary.ca/electrical-software


** Other info:

https://alis.alberta.ca/occinfo/post-secondary-programs/bachelor-of-science-in-software-engineering/university-of-calgary/faed286c-ecb1-4bee-aaaf-a12700c5f332/


* Thompson Rivers University

https://www.tru.ca/science/departments/engineering/software-engineering.html

https://www.tru.ca/programs/catalogue/bachelor-software-engineering.html


** Program description

https://www.tru.ca/science/departments/engineering/software-engineering/program/program-structure.html

** Courses description

https://www.tru.ca/science/departments/engineering/software-engineering/program/program-structure.html
* New Brunswick

** Program description

Joint program of the Faculty of Computer Science and the Department of Electrical and Computer Engineering.

it is *unclear* how it is managed (does it have a director of SEng?, is it ECE the manager)?

https://www.unb.ca/fredericton/engineering/undergrad/swe/index.html

Example of program schedule:

https://www.unb.ca/fredericton/engineering/_assets/documents/matrices/swematrix2018.pdf

https://www.unb.ca/fredericton/engineering/_assets/documents/swe-prereq2013.pdf

- Many courses  are taught by CS, ECE, MATH
- Generic engineering courses
- SWE courses seem to be taught by ECE (Engineering)
  
- 4 SWE labeled courses (seem to be for courses specifically for this program)
  - SWE 4040 Software Engineering Design Project or ENGG 40002 Senior Design Project or TME 40253 Product Design and Development
  - SWE 4103 Software Quality and Project Management
  - SWE 4203 Software Evolution and Maintenance
  - SWE 4403 Software Architecture and Design Patterns


** Courses description

https://www.unb.ca/academics/calendar/undergraduate/current/frederictonprograms/bachelorofscienceinsoftwarenegineering.html

* McMaster University: Software Engineering

https://www.eng.mcmaster.ca/cas/programs/degree-options/beng-software-engineering/

- Offered by the Computing and Software department
- BA in Computer Science and BEng in Software Engineering under the same department
  

** Description of the program and courses

https://academiccalendars.romcmaster.ca//preview_program.php?catoid=53&poid=26837&returnto=10776

The courses required by the Seng program have different prefixes compared to the computer science ones, but I suspect
they are cross-listed (I could not find evidence of it, though).

See following url:

https://www.eng.mcmaster.ca/cas/programs/course-listing/

By the way, McMaster's Department of Computing and Software has a lot of different programs:

https://www.eng.mcmaster.ca/cas/programs/degree-options/

* Ontario Institute of Technology (renamed to Ontario Tech University)

https://engineering.ontariotechu.ca/departments/ecse/software-engineering.php

Offered by the Department of Electrical, Computer and Software Engineering

** Description of Program 

https://calendar.ontariotechu.ca/preview_program.php?catoid=62&poid=13122&returnto=2811

It seems to be completely independent of the CS program and department:

https://calendar.ontariotechu.ca/preview_program.php?catoid=62&poid=13141&returnto=2811

Computer Science is in the faculty of Science.

* Western Ontario

https://www.eng.uwo.ca/electrical//research/areas/software_engineering.html

Faculty of Engineering


** program description:

First year is common to all students in Engineering

https://www.eng.uwo.ca/files/undergraduate/2023-Progression-Sheets/SE_OPA_2023.pdf

Technical electives can be taken in Computer Science, but most technical courses are in ECE.

** Computer science is in a different faculty

https://www.csd.uwo.ca/


* University of Ottawa

https://www.uottawa.ca/faculty-engineering/undergraduate-studies/programs/software-engineering

Faculty of Engineering, but called "School of Electrical Engineering and Computer Science"

https://www.uottawa.ca/faculty-engineering/school-electrical-engineering-computer-science

Merger of CS and ECE

