sengPrograms.html
<div id="outline-container-orgd20459e" class="outline-2">
<h2 id="orgd20459e"><span class="section-number-2">2.</span> University of Calgary</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://www.ucalgary.ca/future-students/undergraduate/explore-programs/software-engineering">https://www.ucalgary.ca/future-students/undergraduate/explore-programs/software-engineering</a>
</p>
</div>
<div id="outline-container-orgbb08b19" class="outline-3">
<h3 id="orgbb08b19"><span class="section-number-3">2.1.</span> Program description:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://www.ucalgary.ca/pubs/calendar/current/en-4-9.html">https://www.ucalgary.ca/pubs/calendar/current/en-4-9.html</a>
</p>

<p>
There are some variations of the program:
</p>

<ul class="org-ul">
<li>Regular Program</li>
<li>Minors:
<ul class="org-ul">
<li>Aerospace</li>
<li>Biomedical Engineering</li>
<li>Mechatronics</li>
<li>BComm combined</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9d27ffd" class="outline-3">
<h3 id="org9d27ffd"><span class="section-number-3">2.2.</span> Courses description</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://www.ucalgary.ca/pubs/calendar/current/software-engineering.html">https://www.ucalgary.ca/pubs/calendar/current/software-engineering.html</a>
</p>

<p>
SEng courses are taught by the CS deparment. See, for example:
</p>

<p>
<a href="https://contacts.ucalgary.ca/info/cpsc/courses/w24">https://contacts.ucalgary.ca/info/cpsc/courses/w24</a>
</p>
</div>
</div>
<div id="outline-container-org83e5766" class="outline-3">
<h3 id="org83e5766"><span class="section-number-3">2.3.</span> Organization: Department of Software Engineering</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://schulich.ucalgary.ca/electrical-software">https://schulich.ucalgary.ca/electrical-software</a>
</p>
</div>
</div>
<div id="outline-container-org3cbbc2c" class="outline-3">
<h3 id="org3cbbc2c"><span class="section-number-3">2.4.</span> Other info:</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://alis.alberta.ca/occinfo/post-secondary-programs/bachelor-of-science-in-software-engineering/university-of-calgary/faed286c-ecb1-4bee-aaaf-a12700c5f332/">https://alis.alberta.ca/occinfo/post-secondary-programs/bachelor-of-science-in-software-engineering/university-of-calgary/faed286c-ecb1-4bee-aaaf-a12700c5f332/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org3616bac" class="outline-2">
<h2 id="org3616bac"><span class="section-number-2">3.</span> Thompson Rivers University</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://www.tru.ca/science/departments/engineering/software-engineering.html">https://www.tru.ca/science/departments/engineering/software-engineering.html</a>
</p>

<p>
<a href="https://www.tru.ca/programs/catalogue/bachelor-software-engineering.html">https://www.tru.ca/programs/catalogue/bachelor-software-engineering.html</a>
</p>
</div>
<div id="outline-container-org5a2a34d" class="outline-3">
<h3 id="org5a2a34d"><span class="section-number-3">3.1.</span> Program description</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://www.tru.ca/science/departments/engineering/software-engineering/program/program-structure.html">https://www.tru.ca/science/departments/engineering/software-engineering/program/program-structure.html</a>
</p>
</div>
</div>
<div id="outline-container-orgfc1034b" class="outline-3">
<h3 id="orgfc1034b"><span class="section-number-3">3.2.</span> Courses description</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://www.tru.ca/science/departments/engineering/software-engineering/program/program-structure.html">https://www.tru.ca/science/departments/engineering/software-engineering/program/program-structure.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org0aaa062" class="outline-2">
<h2 id="org0aaa062"><span class="section-number-2">4.</span> New Brunswick</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga41189a" class="outline-3">
<h3 id="orga41189a"><span class="section-number-3">4.1.</span> Program description</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Joint program of the Faculty of Computer Science and the Department of Electrical and Computer Engineering.
</p>

<p>
it is <b>unclear</b> how it is managed (does it have a director of SEng?, is it ECE the manager)?
</p>

<p>
<a href="https://www.unb.ca/fredericton/engineering/undergrad/swe/index.html">https://www.unb.ca/fredericton/engineering/undergrad/swe/index.html</a>
</p>

<p>
Example of program schedule:
</p>

<p>
<a href="https://www.unb.ca/fredericton/engineering/_assets/documents/matrices/swematrix2018.pdf">https://www.unb.ca/fredericton/engineering/_assets/documents/matrices/swematrix2018.pdf</a>
</p>

<p>
<a href="https://www.unb.ca/fredericton/engineering/_assets/documents/swe-prereq2013.pdf">https://www.unb.ca/fredericton/engineering/_assets/documents/swe-prereq2013.pdf</a>
</p>

<ul class="org-ul">
<li>Many courses  are taught by CS, ECE, MATH</li>
<li>Generic engineering courses</li>
<li>SWE courses seem to be taught by ECE (Engineering)</li>

<li>4 SWE labeled courses (seem to be for courses specifically for this program)
<ul class="org-ul">
<li>SWE 4040 Software Engineering Design Project or ENGG 40002 Senior Design Project or TME 40253 Product Design and Development</li>
<li>SWE 4103 Software Quality and Project Management</li>
<li>SWE 4203 Software Evolution and Maintenance</li>
<li>SWE 4403 Software Architecture and Design Patterns</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaad5e62" class="outline-3">
<h3 id="orgaad5e62"><span class="section-number-3">4.2.</span> Courses description</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="https://www.unb.ca/academics/calendar/undergraduate/current/frederictonprograms/bachelorofscienceinsoftwarenegineering.html">https://www.unb.ca/academics/calendar/undergraduate/current/frederictonprograms/bachelorofscienceinsoftwarenegineering.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org57f2d63" class="outline-2">
<h2 id="org57f2d63"><span class="section-number-2">5.</span> McMaster University: Software Engineering</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://www.eng.mcmaster.ca/cas/programs/degree-options/beng-software-engineering/">https://www.eng.mcmaster.ca/cas/programs/degree-options/beng-software-engineering/</a>
</p>

<ul class="org-ul">
<li>Offered by the Computing and Software department</li>
<li>BA in Computer Science and BEng in Software Engineering under the same department</li>
</ul>
</div>
<div id="outline-container-org6060b3a" class="outline-3">
<h3 id="org6060b3a"><span class="section-number-3">5.1.</span> Description of the program and courses</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://academiccalendars.romcmaster.ca//preview_program.php?catoid=53&amp;poid=26837&amp;returnto=10776">https://academiccalendars.romcmaster.ca//preview_program.php?catoid=53&amp;poid=26837&amp;returnto=10776</a>
</p>

<p>
The courses required by the Seng program have different prefixes compared to the computer science ones, but I suspect
they are cross-listed (I could not find evidence of it, though).
</p>

<p>
See following url:
</p>

<p>
<a href="https://www.eng.mcmaster.ca/cas/programs/course-listing/">https://www.eng.mcmaster.ca/cas/programs/course-listing/</a>
</p>

<p>
By the way, McMaster's Department of Computing and Software has a lot of different programs:
</p>

<p>
<a href="https://www.eng.mcmaster.ca/cas/programs/degree-options/">https://www.eng.mcmaster.ca/cas/programs/degree-options/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org9e7b7ed" class="outline-2">
<h2 id="org9e7b7ed"><span class="section-number-2">6.</span> Ontario Institute of Technology (renamed to Ontario Tech University)</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="https://engineering.ontariotechu.ca/departments/ecse/software-engineering.php">https://engineering.ontariotechu.ca/departments/ecse/software-engineering.php</a>
</p>

<p>
Offered by the Department of Electrical, Computer and Software Engineering
</p>
</div>
<div id="outline-container-orgf5276f8" class="outline-3">
<h3 id="orgf5276f8"><span class="section-number-3">6.1.</span> Description of Program</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<a href="https://calendar.ontariotechu.ca/preview_program.php?catoid=62&amp;poid=13122&amp;returnto=2811">https://calendar.ontariotechu.ca/preview_program.php?catoid=62&amp;poid=13122&amp;returnto=2811</a>
</p>

<p>
It seems to be completely independent of the CS program and department:
</p>

<p>
<a href="https://calendar.ontariotechu.ca/preview_program.php?catoid=62&amp;poid=13141&amp;returnto=2811">https://calendar.ontariotechu.ca/preview_program.php?catoid=62&amp;poid=13141&amp;returnto=2811</a>
</p>

<p>
Computer Science is in the faculty of Science.
</p>
</div>
</div>
</div>
<div id="outline-container-org7f326ab" class="outline-2">
<h2 id="org7f326ab"><span class="section-number-2">7.</span> Western Ontario</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="https://www.eng.uwo.ca/electrical//research/areas/software_engineering.html">https://www.eng.uwo.ca/electrical//research/areas/software_engineering.html</a>
</p>

<p>
Faculty of Engineering
</p>
</div>
<div id="outline-container-org37ac816" class="outline-3">
<h3 id="org37ac816"><span class="section-number-3">7.1.</span> program description:</h3>
<div class="outline-text-3" id="text-7-1">
<p>
First year is common to all students in Engineering
</p>

<p>
<a href="https://www.eng.uwo.ca/files/undergraduate/2023-Progression-Sheets/SE_OPA_2023.pdf">https://www.eng.uwo.ca/files/undergraduate/2023-Progression-Sheets/SE_OPA_2023.pdf</a>
</p>

<p>
Technical electives can be taken in Computer Science, but most technical courses are in ECE.
</p>
</div>
</div>
<div id="outline-container-orge7cbf17" class="outline-3">
<h3 id="orge7cbf17"><span class="section-number-3">7.2.</span> Computer science is in a different faculty</h3>
<div class="outline-text-3" id="text-7-2">
<p>
<a href="https://www.csd.uwo.ca/">https://www.csd.uwo.ca/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org0803d87" class="outline-2">
<h2 id="org0803d87"><span class="section-number-2">8.</span> University of Ottawa</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://www.uottawa.ca/faculty-engineering/undergraduate-studies/programs/software-engineering">https://www.uottawa.ca/faculty-engineering/undergraduate-studies/programs/software-engineering</a>
</p>

<p>
Faculty of Engineering, but called "School of Electrical Engineering and Computer Science"
</p>

<p>
<a href="https://www.uottawa.ca/faculty-engineering/school-electrical-engineering-computer-science">https://www.uottawa.ca/faculty-engineering/school-electrical-engineering-computer-science</a>
</p>

<p>
Merger of CS and ECE
</p>
</div>
