sengPrograms.org
** Program requirements

https://catalogue.uottawa.ca/en/undergrad/basc-software-engineering/#programrequirementstext

- Several courses labelled Computer Science (CSI)

- Computer Science and SEng programs offered by the same department ("School of EE and CS")

** Computer Science program:

https://www.uottawa.ca/faculty-engineering/undergraduate-studies/programs/computer-science

https://catalogue.uottawa.ca/en/undergrad/major-computer-science/#programrequirementstext

* University of Waterloo

https://uwaterloo.ca/software-engineering/

Program is joint between Faculties of Math and Engineering:

#+begin_quote
Faculty of Engineering

Courses provided by the Faculty of Engineering show students how to design and how to solve problems in digital hardware and software.
 
Faculty of Math

Courses provided by the Faculty of Math give students the background they need to understand computing fundamentals and to model and reason about software behaviour.
#+end_quote

Seems to be the best managed of all Canadian programs, with a director, an associate director, a program manager and a capstone coordinator:

https://uwaterloo.ca/software-engineering/contacts

** Program requirements:

https://uwaterloo.ca/software-engineering/undergraduate-students/current-undergraduate-students/curriculum-map

- Courses in Faculty of Math: MATH, STAT, CSc110
- Courses in Faculty of Engr: ECE

- Courses appear to have been divided between departments (I might be wrong). Examplesx
  - SE 350 in ECE
  - SE 212 in CS

* York University

https://lassonde.yorku.ca/academics/software-engineering

This program is under the department of Electrical Engineering and Computer Science, which also offers the Computer Science program.


** Program description

https://lassonde.yorku.ca/eecs/academics/undergraduate/future-students/software-engineering-beng/

* Carleton University

https://admissions.carleton.ca/programs/software-engineering-beng/

Faculty of Engineering and Design.

** Program description

https://carleton.ca/engineering-design/wp-content/uploads/SOFT-23-24.pdf

- Several courses seem to be repeated versions of CS courses (eg. SYSC 4001 Operating Systesm, which "precludes" COMP 3000)
  e.g. https://carleton.ca/sce/wp-content/uploads/SYSC-4001-CourseDescription-04-2020.pdf
- SYSC courses seem to be specifically for SEng students (requirement to be in the SEng program)



* Concordia

https://www.concordia.ca/academics/undergraduate/software-engineering.html

The CS and SEng department manages this program. The department has a chair, and one associate chair for Seng and one associate chair for CS.

https://www.concordia.ca/ginacody/computer-science-software-eng/about/faculty-members.html


** Program description

https://www.concordia.ca/academics/undergraduate/calendar/current/section-71-gina-cody-school-of-engineering-and-computer-science/section-71-70-department-of-computer-science-and-software-engineering/section-71-70-9-degree-requirements-for-the-beng-in-software-engineering.html

https://www.concordia.ca/ginacody/computer-science-software-eng/programs/software-eng/bachelor/course-sequences.html

Almost all courses seem to be offered by the CS and SEng department. So it seems to be managed solely by this department.

* École de technologie supérieure

https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel

Managed by same department that offers computer science.

** Program description

There isn't a lot of information about it.

https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel#Cheminement-type

https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel#Cours-a-suivre

* Lakehead

https://www.lakeheadu.ca/programs/departments/software-engineering

It is the only department in Canada named "Software Engineering" (part of the faculty of Engineering).

The SEng program only includes (2 first, 1 second year) courses from the Computer Science department.

Higher level topic are taught by the Seng department (even when equivalent course exists in CS). For example: "Software
Engineering 3655 Principles of Operating systems"

https://csdc.lakeheadu.ca/Catalog/ViewCatalog.aspx?pageid=viewcatalog&topicgroupid=30351&entitytype=CID&entitycode=Software+Engineering+3655&loaduseredits=True

and "Computer Science 3473 Operating Systems"

https://csdc.lakeheadu.ca/Catalog/ViewCatalog.aspx?pageid=viewcatalog&topicgroupid=22496&entitytype=CID&entitycode=Computer+Science+3473&loaduseredits=True

** Program description

https://csdc.lakeheadu.ca/Catalog/ViewCatalog.aspx?pageid=viewcatalog&catalogid=29&chapterid=9329&topicgroupid=30351&loaduseredits=True

