sengPrograms.html
<div id="outline-container-orgc7011d5" class="outline-3">
<h3 id="orgc7011d5"><span class="section-number-3">8.1.</span> Program requirements</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<a href="https://catalogue.uottawa.ca/en/undergrad/basc-software-engineering/#programrequirementstext">https://catalogue.uottawa.ca/en/undergrad/basc-software-engineering/#programrequirementstext</a>
</p>

<ul class="org-ul">
<li>Several courses labelled Computer Science (CSI)</li>

<li>Computer Science and SEng programs offered by the same department ("School of EE and CS")</li>
</ul>
</div>
</div>
<div id="outline-container-orge0922c9" class="outline-3">
<h3 id="orge0922c9"><span class="section-number-3">8.2.</span> Computer Science program:</h3>
<div class="outline-text-3" id="text-8-2">
<p>
<a href="https://www.uottawa.ca/faculty-engineering/undergraduate-studies/programs/computer-science">https://www.uottawa.ca/faculty-engineering/undergraduate-studies/programs/computer-science</a>
</p>

<p>
<a href="https://catalogue.uottawa.ca/en/undergrad/major-computer-science/#programrequirementstext">https://catalogue.uottawa.ca/en/undergrad/major-computer-science/#programrequirementstext</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org31e105f" class="outline-2">
<h2 id="org31e105f"><span class="section-number-2">9.</span> University of Waterloo</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="https://uwaterloo.ca/software-engineering/">https://uwaterloo.ca/software-engineering/</a>
</p>

<p>
Program is joint between Faculties of Math and Engineering:
</p>

<blockquote>
<p>
Faculty of Engineering
</p>

<p>
Courses provided by the Faculty of Engineering show students how to design and how to solve problems in digital hardware and software.
</p>

<p>
Faculty of Math
</p>

<p>
Courses provided by the Faculty of Math give students the background they need to understand computing fundamentals and to model and reason about software behaviour.
</p>
</blockquote>

<p>
Seems to be the best managed of all Canadian programs, with a director, an associate director, a program manager and a capstone coordinator:
</p>

<p>
<a href="https://uwaterloo.ca/software-engineering/contacts">https://uwaterloo.ca/software-engineering/contacts</a>
</p>
</div>
<div id="outline-container-org086b764" class="outline-3">
<h3 id="org086b764"><span class="section-number-3">9.1.</span> Program requirements:</h3>
<div class="outline-text-3" id="text-9-1">
<p>
<a href="https://uwaterloo.ca/software-engineering/undergraduate-students/current-undergraduate-students/curriculum-map">https://uwaterloo.ca/software-engineering/undergraduate-students/current-undergraduate-students/curriculum-map</a>
</p>

<ul class="org-ul">
<li>Courses in Faculty of Math: MATH, STAT, CSc110</li>
<li>Courses in Faculty of Engr: ECE</li>

<li>Courses appear to have been divided between departments (I might be wrong). Examplesx
<ul class="org-ul">
<li>SE 350 in ECE</li>
<li>SE 212 in CS</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9e0d5db" class="outline-2">
<h2 id="org9e0d5db"><span class="section-number-2">10.</span> York University</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="https://lassonde.yorku.ca/academics/software-engineering">https://lassonde.yorku.ca/academics/software-engineering</a>
</p>

<p>
This program is under the department of Electrical Engineering and Computer Science, which also offers the Computer Science program.
</p>
</div>
<div id="outline-container-orgb6d2d91" class="outline-3">
<h3 id="orgb6d2d91"><span class="section-number-3">10.1.</span> Program description</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<a href="https://lassonde.yorku.ca/eecs/academics/undergraduate/future-students/software-engineering-beng/">https://lassonde.yorku.ca/eecs/academics/undergraduate/future-students/software-engineering-beng/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org2e4a035" class="outline-2">
<h2 id="org2e4a035"><span class="section-number-2">11.</span> Carleton University</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="https://admissions.carleton.ca/programs/software-engineering-beng/">https://admissions.carleton.ca/programs/software-engineering-beng/</a>
</p>

<p>
Faculty of Engineering and Design.
</p>
</div>
<div id="outline-container-orgb804a69" class="outline-3">
<h3 id="orgb804a69"><span class="section-number-3">11.1.</span> Program description</h3>
<div class="outline-text-3" id="text-11-1">
<p>
<a href="https://carleton.ca/engineering-design/wp-content/uploads/SOFT-23-24.pdf">https://carleton.ca/engineering-design/wp-content/uploads/SOFT-23-24.pdf</a>
</p>

<ul class="org-ul">
<li>Several courses seem to be repeated versions of CS courses (eg. SYSC 4001 Operating Systesm, which "precludes" COMP 3000)
e.g. <a href="https://carleton.ca/sce/wp-content/uploads/SYSC-4001-CourseDescription-04-2020.pdf">https://carleton.ca/sce/wp-content/uploads/SYSC-4001-CourseDescription-04-2020.pdf</a></li>
<li>SYSC courses seem to be specifically for SEng students (requirement to be in the SEng program)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6c715a7" class="outline-2">
<h2 id="org6c715a7"><span class="section-number-2">12.</span> Concordia</h2>
<div class="outline-text-2" id="text-12">
<p>
<a href="https://www.concordia.ca/academics/undergraduate/software-engineering.html">https://www.concordia.ca/academics/undergraduate/software-engineering.html</a>
</p>

<p>
The CS and SEng department manages this program. The department has a chair, and one associate chair for Seng and one associate chair for CS.
</p>

<p>
<a href="https://www.concordia.ca/ginacody/computer-science-software-eng/about/faculty-members.html">https://www.concordia.ca/ginacody/computer-science-software-eng/about/faculty-members.html</a>
</p>
</div>
<div id="outline-container-org62d3790" class="outline-3">
<h3 id="org62d3790"><span class="section-number-3">12.1.</span> Program description</h3>
<div class="outline-text-3" id="text-12-1">
<p>
<a href="https://www.concordia.ca/academics/undergraduate/calendar/current/section-71-gina-cody-school-of-engineering-and-computer-science/section-71-70-department-of-computer-science-and-software-engineering/section-71-70-9-degree-requirements-for-the-beng-in-software-engineering.html">https://www.concordia.ca/academics/undergraduate/calendar/current/section-71-gina-cody-school-of-engineering-and-computer-science/section-71-70-department-of-computer-science-and-software-engineering/section-71-70-9-degree-requirements-for-the-beng-in-software-engineering.html</a>
</p>

<p>
<a href="https://www.concordia.ca/ginacody/computer-science-software-eng/programs/software-eng/bachelor/course-sequences.html">https://www.concordia.ca/ginacody/computer-science-software-eng/programs/software-eng/bachelor/course-sequences.html</a>
</p>

<p>
Almost all courses seem to be offered by the CS and SEng department. So it seems to be managed solely by this department.
</p>
</div>
</div>
</div>
<div id="outline-container-org095cc84" class="outline-2">
<h2 id="org095cc84"><span class="section-number-2">13.</span> École de technologie supérieure</h2>
<div class="outline-text-2" id="text-13">
<p>
<a href="https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel">https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel</a>
</p>

<p>
Managed by same department that offers computer science.
</p>
</div>
<div id="outline-container-org338695b" class="outline-3">
<h3 id="org338695b"><span class="section-number-3">13.1.</span> Program description</h3>
<div class="outline-text-3" id="text-13-1">
<p>
There isn't a lot of information about it.
</p>

<p>
<a href="https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel#Cheminement-type">https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel#Cheminement-type</a>
</p>

<p>
<a href="https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel#Cours-a-suivre">https://www.etsmtl.ca/etudes/premier-cycle/baccalaureat-genie-logiciel#Cours-a-suivre</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd260469" class="outline-2">
<h2 id="orgd260469"><span class="section-number-2">14.</span> Lakehead</h2>
<div class="outline-text-2" id="text-14">
<p>
<a href="https://www.lakeheadu.ca/programs/departments/software-engineering">https://www.lakeheadu.ca/programs/departments/software-engineering</a>
</p>

<p>
It is the only department in Canada named "Software Engineering" (part of the faculty of Engineering).
</p>

<p>
The SEng program only includes (2 first, 1 second year) courses from the Computer Science department.
</p>

<p>
Higher level topic are taught by the Seng department (even when equivalent course exists in CS). For example: "Software
Engineering 3655 Principles of Operating systems"
</p>

<p>
<a href="https://csdc.lakeheadu.ca/Catalog/ViewCatalog.aspx?pageid=viewcatalog&amp;topicgroupid=30351&amp;entitytype=CID&amp;entitycode=Software+Engineering+3655&amp;loaduseredits=True">https://csdc.lakeheadu.ca/Catalog/ViewCatalog.aspx?pageid=viewcatalog&amp;topicgroupid=30351&amp;entitytype=CID&amp;entitycode=Software+Engineering+3655&amp;loaduseredits=True</a>
</p>

<p>
and "Computer Science 3473 Operating Systems"
</p>

<p>
<a href="https://csdc.lakeheadu.ca/Catalog/ViewCatalog.aspx?pageid=viewcatalog&amp;topicgroupid=22496&amp;entitytype=CID&amp;entitycode=Computer+Science+3473&amp;loaduseredits=True">https://csdc.lakeheadu.ca/Catalog/ViewCatalog.aspx?pageid=viewcatalog&amp;topicgroupid=22496&amp;entitytype=CID&amp;entitycode=Computer+Science+3473&amp;loaduseredits=True</a>
</p>
</div>
